//1) Написати функцію compact() яка має приймати на вхід масив, а на вихід має повертати значення нового масиву без повторень.

let arr = [5,4,3,2,1,5,4,6,7,3];
function compact(array){
  for (let i in array){
      for (let y in array){
          if (i == y){
              continue;
          }
          if (array[i] == array[y]){
              array.splice(y, 1);
          }
      }
  }
  return array;
}
let arr2 = compact(arr);
console.log(arr2);

2) Написати функцію createArray(start, end), яка приймає на вхід 2 параметри: початкове значення, кінцеве значення.Hа виході отримує масив із діапазоном цих
 значень (реалізувати достатньо лише із числовими значеннями)

 function createArray(start, end){
  let arr = [];
  for (let i = start; i <= end; i++) {
      arr.push(i);
  }
  return arr;
}
let arr = createArray(1, 12);
console.log(arr);


 3) Створити функцію, яка використовує метод trim() для рядків. Дана функція має брати на вхід рядок із іменами, та сортувати їх по алфавіту, але між
  іменами може бути багато пробелів(функція має їх забирати)

function sortNames (str){
  let sort = str.split(",");
  for( let i in sort){
          sort[i] = sort[i].trim();
      }

      sort.sort();

      let Sort = sort.join(', ')

      return Sort;
  }
let names = "Roman,    Inna, Sofija,    Olena     , Martin";
let newNames = sortNames(names);
console.log(newNames);


  4) Фільтрувати масив об’єктів по віку, тобто новий масив має складатись із об’єктів які старше 18 років.

  let arr = [  
    { name: "Andrzej Duda", age: 46},  
    { name: "Nikolas Kage", age: 4 },  
    { name: "Adolf Hitler", age: 33 },  
    { name: "Jordano Bloom", age: 51 },  
    { name: "Vitalik Bucyk", age: 22 }
    ];
let newArray = arr.filter(obj => obj.age >= 18);
console.log(newArray);



5) Напишіть функцію яка знаходить в масиві двозначні(10+), трьохзначні(100+) та чотирьохзначні(1000+)  числа та повертає в масив їх кількість.

6) Є масив [5, “Limit”, 12, “a”, “3”, 99, 2, [2, 4, 3, “33”, “a”, “text”], “strong”, “broun”]
Написати функцію яка виведе нові масиви яка складаються із даних початкового масиву, але одного типу даних (не приводити тип стрінг в число навіть якщо там лише число)

7) Додати на початок масиву [3, 7, 9] значенння [4, 3, 9] та на кінець масиву значення [8, 7, 6] різними способами

8) Даний масив, вибрати із нього всі парні числа, та всі непарні числа, потім проставити всі парні числа у відповідність парним індексам масиву, а непарні — непарним індексам масиву

9) Напишіть функцію яка приймає 2 аргументи, ім’я та прізвище, та повертає як результат ЦІЛУ строку ім`я та прізвище. Додати додатково третій параметр - функцію яка буде 
переводити у певний регістр цю строку, верхній, нижній або кожне слово із великої літери(це три окремі функції мають бути) а також видаляє зайві пробели.

10) Створити функцію яка приймає 2 аргументи (логін, пароль). Функція має перевіряти введені дані на наявність таких даних в масиві який є всередині цієї функції.
якщо логін та пароль співпадають із даними які є в масиві тоді вивести повідомлення Ви авторизовані, інакше вивести — Логін або Пароль не вірний.






 

